gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c

/************** RAIO Technology Inc. / Lcdvision Co., Ltd.***************
 * file			: RA8889_API_51.c
 * author		: BW.SU
 * version	: V1.2
 * date			: 2024/06/07
 * brief		:
 *					（1）延时函数，原代码所有us级别全部改为ms级别
 *					（2）将特定关键字data修改为data_array
 *					（3）NAND FLASH功能函数移植起来相对复杂，暂时屏蔽
 *					（4）删除调用自建ASCII字库的相关函数
  *					（5）修正部份函数，8位机计算整型变量可能会溢出，改为长整型
************************* bbs.lcdvision.com.cn **************************/

#include "stc8h.h"       //包含此头文件后，不需要再包含"reg51.h"头文件
#include <intrins.h>
#include <stdio.h>

/* RA8889头文件 */
#include "RA8889_51.h"
#include "RA8889_API_51.h"
#include "RA8889_MCU_IF.h"
#include "UserDef.h"
#include "delay.h"



/*================================================================*/
//									CUSTOMER LEVEL API FUNCTIONS	
/*================================================================*/

void MPU8_8bpp_Memory_Write(
    unsigned short x // x of coordinate
    ,
    unsigned short y // y of coordinate
    ,
    unsigned short w // width
    ,
    unsigned short h // height
    ,
    const unsigned char *data_array // 8bit data
)
{
    unsigned short i, j;
    Graphic_Mode();
    Active_Window_XY(x, y);
    Active_Window_WH(w, h);
    Goto_Pixel_XY(x, y);
    LCD_CmdWrite(0x04);
    for (i = 0; i < h; i++) {
        for (j = 0; j < w; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
}

void MPU8_16bpp_Memory_Write(
    unsigned short x // x of coordinate
    ,
    unsigned short y // y of coordinate
    ,
    unsigned short w // width
    ,
    unsigned short h // height
    ,
    const unsigned char *data_array // 8bit data
)
{
    unsigned short i, j;
    Graphic_Mode();
    Active_Window_XY(x, y);
    Active_Window_WH(w, h);
    Goto_Pixel_XY(x, y);
    LCD_CmdWrite(0x04);
    for (i = 0; i < h; i++) {
        for (j = 0; j < w; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
}

void MPU8_24bpp_Memory_Write(
    unsigned short x // x of coordinate
    ,
    unsigned short y // y of coordinate
    ,
    unsigned short w // width
    ,
    unsigned short h // height
    ,
    const unsigned char *data_array // 8bit data
)

{
    unsigned short i, j;
    Graphic_Mode();
    Active_Window_XY(x, y);
    Active_Window_WH(w, h);
    Goto_Pixel_XY(x, y);
    LCD_CmdWrite(0x04);
    for (i = 0; i < h; i++) {
        for (j = 0; j < w; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
}

void MPU16_16bpp_Memory_Write(
    unsigned short x // x of coordinate
    ,
    unsigned short y // y of coordinate
    ,
    unsigned short w // width
    ,
    unsigned short h // height
    ,
    const unsigned short *data_array // 16bit data
)
{
    unsigned short i, j;
    Graphic_Mode();
    Active_Window_XY(x, y);
    Active_Window_WH(w, h);
    Goto_Pixel_XY(x, y);
    LCD_CmdWrite(0x04);
    for (i = 0; i < h; i++) {
        for (j = 0; j < w; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
}

void MPU16_24bpp_Mode1_Memory_Write(
    unsigned short x // x of coordinate
    ,
    unsigned short y // y of coordinate
    ,
    unsigned short w // width
    ,
    unsigned short h // height
    ,
    const unsigned short *data_array // 16bit data
)
{
    unsigned short i, j;
    Graphic_Mode();
    Active_Window_XY(x, y);
    Active_Window_WH(w, h);
    Goto_Pixel_XY(x, y);
    LCD_CmdWrite(0x04);
    for (i = 0; i < h; i++) {
        for (j = 0; j < w / 2; j++) {
            LCD_DataWrite(*data_array);
            Check_Mem_WR_FIFO_not_Full();
            data_array++;
            LCD_DataWrite(*data_array);
            Check_Mem_WR_FIFO_not_Full();
            data_array++;
            LCD_DataWrite(*data_array);
            Check_Mem_WR_FIFO_not_Full();
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
}

void MPU16_24bpp_Mode2_Memory_Write(
    unsigned short x // x of coordinate
    ,
    unsigned short y // y of coordinate
    ,
    unsigned short w // width
    ,
    unsigned short h // height
    ,
    const unsigned short *data_array // 16bit data
)
{
    unsigned short i, j;
    Graphic_Mode();
    Active_Window_XY(x, y);
    Active_Window_WH(w, h);
    Goto_Pixel_XY(x, y);
    LCD_CmdWrite(0x04);
    for (i = 0; i < h; i++) {
        for (j = 0; j < w; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
}

//void PIP(bool On_Off, uint8_t PSelect, uint32_t PAddr, uint16_t Px, uint16_t Py, uint32_t ImageWidth, uint16_t Dx, uint16_t Dy, uint16_t Dwidth, uint16_t DHeight);
void PIP(
    unsigned char On_Off // 0 : disable PIP, 1 : enable PIP, 2 : To maintain the original state
    ,
    unsigned char Select_PIP // 1 : use PIP1 , 2 : use PIP2
    ,
    unsigned long PAddr // start address of PIP
    ,
    unsigned short XP // coordinate X of PIP Window, It must be divided by 4.
    ,
    unsigned short YP // coordinate Y of PIP Window, It must be divided by 4.
    ,
    unsigned long ImageWidth // Image Width of PIP (recommend = canvas image width)
    ,
    unsigned short X_Dis // coordinate X of Display Window
    ,
    unsigned short Y_Dis // coordinate Y of Display Window
    ,
    unsigned short X_W // width of PIP and Display Window, It must be divided by 4.
    ,
    unsigned short Y_H // height of PIP and Display Window , It must be divided by 4.
)
{
    if (Select_PIP == 1) {
        Select_PIP1_Parameter();
    }
    if (Select_PIP == 2) {
        Select_PIP2_Parameter();
    }
    PIP_Display_Start_XY(X_Dis, Y_Dis);
    PIP_Image_Start_Address(PAddr);
    PIP_Image_Width(ImageWidth);
    PIP_Window_Image_Start_XY(XP, YP);
    PIP_Window_Width_Height(X_W, Y_H);

    if (On_Off == 0) {
        if (Select_PIP == 1) {
            Disable_PIP1();
        }
        if (Select_PIP == 2) {
            Disable_PIP2();
        }
    }

