gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
    if (On_Off == 1) {
        if (Select_PIP == 1) {
            Enable_PIP1();
        }
        if (Select_PIP == 2) {
            Enable_PIP2();
        }
    }
}

/*internal font
x : Print font start coordinate of X
y : Print font start coordinate of Y
X_W : active window width
Y_H : active window height
FontColor : Set Font Color
BackGroundColor : Set Font BackGround Color
Font Color and BackGround Color dataformat :
ColorDepth_8bpp : R3G3B2
ColorDepth_16bpp : R5G6B5
ColorDepth_24bpp : R8G8B8
tmp2 : Hex variable you want print (range : 0 ~ 32bit)
*/
void Print_Internal_Font_Hexvariable(unsigned short x, unsigned short y, unsigned short X_W, unsigned short Y_H, unsigned long FontColor, unsigned long BackGroundColor, unsigned int tmp2)
{
    Text_Mode();
    CGROM_Select_Internal_CGROM();
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(FontColor);
    Background_color_256(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
    Active_Window_XY(x, y);
    Active_Window_WH(X_W, Y_H);
    Goto_Text_XY(x, y);
//    sprintf(tmp1, "%X", tmp2);
//    Show_String(tmp1);
}

/*internal font
x : Print font start coordinate of X
y : Print font start coordinate of Y
X_W : active window width
Y_H : active window height
FontColor : Set Font Color
BackGroundColor : Set Font BackGround Color
Font Color and BackGround Color dataformat :
ColorDepth_8bpp : R3G3B2
ColorDepth_16bpp : R5G6B5
ColorDepth_24bpp : R8G8B8
tmp2 : Decimalvariable you want print (range : 0 ~ 32bit)
*/
void Print_Internal_Font_Decimalvariable(unsigned short x, unsigned short y, unsigned short X_W, unsigned short Y_H, unsigned long FontColor, unsigned long BackGroundColor, unsigned int tmp2)
{

    Text_Mode();
    CGROM_Select_Internal_CGROM();
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(FontColor);
    Background_color_256(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
    Active_Window_XY(x, y);
    Active_Window_WH(X_W, Y_H);
    Goto_Text_XY(x, y);
//    sprintf(tmp1, "%d", tmp2);
//    Show_String(tmp1);
}

void Print_Internal_Font_String(
    unsigned short x // coordinate x for print string
    ,
    unsigned short y // coordinate x for print string
    ,
    unsigned short X_W // active window width
    ,
    unsigned short Y_H // active window height
    ,
    unsigned long FontColor // FontColor : Set Font Color
    ,
    unsigned long BackGroundColor
    /*BackGroundColor : Set Font BackGround Color.Font Color and BackGround Color dataformat :
    ColorDepth_8bpp : R3G3B2
    ColorDepth_16bpp : R5G6B5
    ColorDepth_24bpp : R8G8B8*/
    ,
    char tmp2[] // tmp2 : Font String which you want print on LCD
)
{

    Text_Mode();
    CGROM_Select_Internal_CGROM();
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(FontColor);
    Background_color_256(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
    Active_Window_XY(x, y);
    Active_Window_WH(X_W, Y_H);
    Goto_Text_XY(x, y);
    //	sprintf(tmp1,"%s",tmp2);
    //	Show_String(tmp1);
//    Show_String(tmp2);
}

void Print_BIG5String(
    unsigned char Clk // SPI CLK = System Clock / 2*(Clk+1)
    ,
    unsigned char BUS // 0 : Bus0, 1:Bus1
    ,
    unsigned char SCS // 0 : use CS0 , 1 : use CS1 , 2 : use CS2, 3 :use CS3
    ,
    unsigned short x // coordinate x for print string
    ,
    unsigned short y // coordinate y for print string
    ,
    unsigned short X_W // active window width
    ,
    unsigned short Y_H // active window height
    ,
    unsigned long FontColor // Set Font Color
    ,
    unsigned long BackGroundColor // Set Font BackGround Color
    /*Font Color and BackGround Color dataformat :
    ColorDepth_8bpp : R3G3B2
    ColorDepth_16bpp : R5G6B5
    ColorDepth_24bpp : R8G8B8*/
    ,
    char *tmp2 // tmp2 : BIG5 Font String which you want print on LCD
)
{

    Select_SFI_Font_Mode();
    CGROM_Select_Genitop_FontROM();
    SPI_Clock_Period(Clk);
    Set_GTFont_Decoder(0x11);

    Select_SFI_24bit_Address();
    Select_RA8875_SPI_Mode0_and_Mode3();
    Select_SFI_Single_Mode_Dummy_0T_03h();

    switch (SCS) {
        case 0:
            Select_SFI_0();
            break;
        case 1:
            Select_SFI_1();
            break;
        case 2:
            Select_SFI_2();
            break;
        case 3:
            Select_SFI_3();
            break;
    }

    switch (BUS) {
        case 0:
            FONT_DMA_Select_Bus_0();
            break;
        case 1:
            FONT_DMA_Select_Bus_1();
            break;
    }

#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(FontColor);
    Background_color_256(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
    Text_Mode();
    Active_Window_XY(x, y);
    Active_Window_WH(X_W, Y_H);
    Goto_Text_XY(x, y);
    //  sprintf(tmp1,"%s",tmp2);
    //  Show_String(tmp1);
//    Show_String(tmp2);
}

void Print_GB2312String(
    unsigned char Clk // Clk : SPI CLK = System Clock / 2*(Clk+1)
    ,
    unsigned char BUS // 0 : Bus0, 1:Bus1
    ,
    unsigned char SCS // 0 : use CS0 , 1 : use CS1 , 2 : use CS2, 3 :use CS3
    ,
    unsigned short x // coordinate x for print string
    ,
    unsigned short y // coordinate y for print string
    ,
    unsigned short X_W // active window width
    ,
    unsigned short Y_H // active window height
    ,
    unsigned long FontColor // Set Font Color
    ,
    unsigned long BackGroundColor // Set Font BackGround Color
    /*Font Color and BackGround Color dataformat :
    ColorDepth_8bpp : R3G3B2
    ColorDepth_16bpp : R5G6B5
    ColorDepth_24bpp : R8G8B8*/
    ,
    char tmp2[] // tmp2 : GB2312 Font String which you want print on LCD
)
{

    Select_SFI_Font_Mode();
    CGROM_Select_Genitop_FontROM();
    SPI_Clock_Period(Clk);

    Select_SFI_24bit_Address();
    Select_RA8875_SPI_Mode0_and_Mode3();
    Select_SFI_Single_Mode_Dummy_0T_03h();

    switch (SCS) {
        case 0:
            Select_SFI_0();
            break;
        case 1:
            Select_SFI_1();
            break;
        case 2:
            Select_SFI_2();
            break;
        case 3:
            Select_SFI_3();
            break;
    }

    switch (BUS) {
        case 0:
            FONT_DMA_Select_Bus_0();
            break;
        case 1:
            FONT_DMA_Select_Bus_1();
            break;
    }

#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(FontColor);
    Background_color_256(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
    Text_Mode();
    Active_Window_XY(x, y);
    Active_Window_WH(X_W, Y_H);
    Goto_Text_XY(x, y);
    //  sprintf(tmp1,"%s",tmp2);
    //  Show_String(tmp1);
//    Show_String(tmp2);
}

void Print_GB12345String(
    unsigned char Clk // Clk : SPI CLK = System Clock / 2*(Clk+1)
    ,
    unsigned char BUS // 0 : Bus0, 1:Bus1
    ,
    unsigned char SCS // 0 : use CS0 , 1 : use CS1 , 2 : use CS2, 3 :use CS3
    ,
    unsigned short x // coordinate x for print string
    ,
    unsigned short y ////coordinate y for print string
    ,
    unsigned short X_W // active window width
    ,
    unsigned short Y_H // active window height
    ,
    unsigned long FontColor // Set Font Color
    ,
    unsigned long BackGroundColor // Set Font BackGround Color
    /*Font Color and BackGround Color dataformat :
    ColorDepth_8bpp : R3G3B2
    ColorDepth_16bpp : R5G6B5
    ColorDepth_24bpp : R8G8B8*/
    ,
    char *tmp2 // tmp2 : GB12345 Font String which you want print on LCD
)
{
    Select_SFI_Font_Mode();
    CGROM_Select_Genitop_FontROM();
    SPI_Clock_Period(Clk);
    Set_GTFont_Decoder(0x05);

    Select_SFI_24bit_Address();
    Select_RA8875_SPI_Mode0_and_Mode3();
    Select_SFI_Single_Mode_Dummy_0T_03h();

    switch (SCS) {
        case 0:
            Select_SFI_0();
            break;
        case 1:
            Select_SFI_1();
            break;
        case 2:
            Select_SFI_2();
            break;
        case 3:
            Select_SFI_3();
            break;
    }

    switch (BUS) {
        case 0:
            FONT_DMA_Select_Bus_0();
            break;
        case 1:
            FONT_DMA_Select_Bus_1();
            break;
    }

#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(FontColor);
    Background_color_256(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
    Text_Mode();
    Active_Window_XY(x, y);
    Active_Window_WH(X_W, Y_H);
    Goto_Text_XY(x, y);
    //  sprintf(tmp1,"%s",tmp2);
    //  Show_String(tmp1);
//    Show_String(tmp2);
}

void Print_UnicodeString(
    unsigned char Clk // SPI CLK = System Clock / 2*(Clk+1)
    ,
    unsigned char BUS // 0 : Bus0, 1:Bus1
    ,
    unsigned char SCS // 0 : use CS0 , 1 : use CS1 , 2 : use CS2, 3 :use CS3
    ,
    unsigned short x // Print font start coordinate of X
    ,
    unsigned short y // Print font start coordinate of Y
    ,
    unsigned short X_W // active window width
    ,
    unsigned short Y_H // active window height
    ,
    unsigned long FontColor // Set Font Color
    ,
    unsigned long BackGroundColor // Set Font BackGround Color
    /*Font Color and BackGround Color dataformat :
    ColorDepth_8bpp : R3G3B2
    ColorDepth_16bpp : R5G6B5
    ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short *tmp2 /*tmp2 : Unicode Font String which you want print on LCD (L"string" in keil c is Unicode string)*/
)
{
    Select_SFI_Font_Mode();
    CGROM_Select_Genitop_FontROM();
    SPI_Clock_Period(Clk);

    Select_SFI_24bit_Address();
    Select_RA8875_SPI_Mode0_and_Mode3();
    Select_SFI_Single_Mode_Dummy_0T_03h();

    switch (SCS) {
        case 0:
            Select_SFI_0();
            break;
        case 1:
            Select_SFI_1();
            break;
        case 2:
            Select_SFI_2();
            break;
        case 3:
            Select_SFI_3();
            break;
    }

    switch (BUS) {
        case 0:
            FONT_DMA_Select_Bus_0();
            break;
        case 1:
            FONT_DMA_Select_Bus_1();
            break;
    }

#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(FontColor);
    Background_color_256(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(FontColor);
    Background_color_65k(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(FontColor);
    Background_color_16M(BackGroundColor);
#endif
    Text_Mode();
    Active_Window_XY(x, y);
    Active_Window_WH(X_W, Y_H);
    Goto_Text_XY(x, y);
    while (*tmp2 != '\0') {
        if ((*tmp2) > 0x0020 && (*tmp2) < 0x0080) {
            /* ASCII Code*/
            Set_GTFont_Decoder(0x21);
            LCD_CmdWrite(0x04);
            LCD_DataWrite(*tmp2);
            Check_2D_Busy();
        } else {
            /* Unicode */
            Set_GTFont_Decoder(0x18);
            LCD_CmdWrite(0x04);
            LCD_DataWrite((*tmp2) >> 8);
            LCD_DataWrite(*tmp2);
            Check_2D_Busy();
        }
        ++tmp2;
    }

    /* Aribrial */
    Set_GTFont_Decoder(0x3a);
    LCD_CmdWrite(0x04);
    LCD_DataWrite(0x060C);
    Check_2D_Busy();

