gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
    Graphic_Mode(); // back to graphic mode
}

void Select_Font_Height_WxN_HxN_ChromaKey_Alignment(
    unsigned char Font_Height
    /*Font_Height:
    16 : Font = 8x16 16x16
    24 : Font = 12x2424x24
    32 : Font = 16x3232x32 */
    ,
    unsigned char XxN // XxN :Font Width x 1~4
    ,
    unsigned char YxN // YxN :Font Height x 1~4
    ,
    unsigned char ChromaKey
    /*ChromaKey :
    0 : Font Background color not transparency
    1 : Set Font Background color transparency*/
    ,
    unsigned char Alignment // 0 : no alignment, 1 : Set font alignment
)
{
    if (Font_Height == 16) Font_Select_8x16_16x16();
    if (Font_Height == 24) Font_Select_12x24_24x24();
    if (Font_Height == 32) Font_Select_16x32_32x32();

    //(*)
    if (XxN == 1) Font_Width_X1();
    if (XxN == 2) Font_Width_X2();
    if (XxN == 3) Font_Width_X3();
    if (XxN == 4) Font_Width_X4();

    //(*)
    if (YxN == 1) Font_Height_X1();
    if (YxN == 2) Font_Height_X2();
    if (YxN == 3) Font_Height_X3();
    if (YxN == 4) Font_Height_X4();

    //(*)
    if (ChromaKey == 0) { Font_Background_select_Color(); }

    if (ChromaKey == 1) { Font_Background_select_Original_Canvas(); }

    //(*)
    if (Alignment == 0) { Disable_Font_Alignment(); }

    if (Alignment == 1) { Enable_Font_Alignment(); }
}

void Show_String(char *str)
{
    Check_Mem_WR_FIFO_Empty();

    Text_Mode();

    LCD_CmdWrite(0x04);
    while (*str != '\0') {
        Check_Mem_WR_FIFO_not_Full();
        LCD_DataWrite(*str);
        ++str;
    }
    Check_2D_Busy();
    Graphic_Mode(); // back to graphic mode
}

void Draw_Line(
    unsigned long LineColor
    /*LineColor : Set Draw Line color. Line Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short X1 // X of point1 coordinate
    ,
    unsigned short Y1 // Y of point1 coordinate
    ,
    unsigned short X2 // X of point2 coordinate
    ,
    unsigned short Y2 // Y of point2 coordinate
)
{

#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(LineColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(LineColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(LineColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(LineColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(LineColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(LineColor);
#endif
    Line_Start_XY(X1, Y1);
    Line_End_XY(X2, Y2);
    Start_Line();
    Check_2D_Busy();
}

void Draw_Triangle(
    unsigned long ForegroundColor
    /*ForegroundColor: Set Draw Triangle color. ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short X1 // X of point1 coordinate
    ,
    unsigned short Y1 // Y of point1 coordinate
    ,
    unsigned short X2 // X of point2 coordinate
    ,
    unsigned short Y2 // Y of point2 coordinate
    ,
    unsigned short X3 // X of point3 coordinate
    ,
    unsigned short Y3 // Y of point3 coordinate
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Triangle_Point1_XY(X1, Y1);
    Triangle_Point2_XY(X2, Y2);
    Triangle_Point3_XY(X3, Y3);
    Start_Triangle();
    Check_2D_Busy();
}

void Draw_Triangle_Fill(
    unsigned long ForegroundColor
    /*ForegroundColor: Set Draw Triangle color. ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short X1 // X of point1 coordinate
    ,
    unsigned short Y1 // Y of point1 coordinate
    ,
    unsigned short X2 // X of point2 coordinate
    ,
    unsigned short Y2 // Y of point2 coordinate
    ,
    unsigned short X3 // X of point3 coordinate
    ,
    unsigned short Y3 // Y of point3 coordinate
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Triangle_Point1_XY(X1, Y1);
    Triangle_Point2_XY(X2, Y2);
    Triangle_Point3_XY(X3, Y3);
    Start_Triangle_Fill();
    Check_2D_Busy();
}

void Draw_Circle(
    unsigned long ForegroundColor // ForegroundColor: Set Draw Circle or Circle Fill color
    /*ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short R // Circle Radius
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Circle_Center_XY(XCenter, YCenter);
    Circle_Radius_R(R);
    Start_Circle_or_Ellipse();
    Check_2D_Busy();
}

void Draw_Circle_Fill(
    unsigned long ForegroundColor
    /*ForegroundColor: Set Draw Circle or Circle Fill color
    ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short R // Circle Radius
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Circle_Center_XY(XCenter, YCenter);
    Circle_Radius_R(R);
    Start_Circle_or_Ellipse_Fill();
    Check_2D_Busy();
}

void Draw_Ellipse(
    unsigned long ForegroundColor // ForegroundColor : Set Draw Ellipse or Ellipse Fill color
    /*ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short X_R // Radius Width of Ellipse
    ,
    unsigned short Y_R // Radius Length of Ellipse
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Ellipse_Center_XY(XCenter, YCenter);
    Ellipse_Radius_RxRy(X_R, Y_R);
    Start_Circle_or_Ellipse();
    Check_2D_Busy();
}

void Draw_Ellipse_Fill(
    unsigned long ForegroundColor // ForegroundColor : Set Draw Ellipse or Ellipse Fill color
    /*ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short X_R // Radius Width of Ellipse
    ,
    unsigned short Y_R // Radius Length of Ellipse
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Ellipse_Center_XY(XCenter, YCenter);
    Ellipse_Radius_RxRy(X_R, Y_R);
    Start_Circle_or_Ellipse_Fill();
    Check_2D_Busy();
}

void Draw_Left_Up_Curve(
    unsigned long ForegroundColor // ForegroundColor: Set Curve or Curve Fill color
    /*ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short X_R // Radius Width of Curve
    ,
    unsigned short Y_R // Radius Length of Curve
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Ellipse_Center_XY(XCenter, YCenter);
    Ellipse_Radius_RxRy(X_R, Y_R);
    Start_Left_Up_Curve();
    Check_2D_Busy();
}

