gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
void Draw_Left_Up_Curve_Fill(
    unsigned long ForegroundColor // ForegroundColor: Set Curve or Curve Fill color
    /*ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short X_R // Radius Width of Curve
    ,
    unsigned short Y_R // Radius Length of Curve
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Ellipse_Center_XY(XCenter, YCenter);
    Ellipse_Radius_RxRy(X_R, Y_R);
    Start_Left_Up_Curve_Fill();
    Check_2D_Busy();
}

void Draw_Right_Down_Curve(
    unsigned long ForegroundColor // ForegroundColor: Set Curve or Curve Fill color
    /*ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short X_R // Radius Width of Curve
    ,
    unsigned short Y_R // Radius Length of Curve
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Ellipse_Center_XY(XCenter, YCenter);
    Ellipse_Radius_RxRy(X_R, Y_R);
    Start_Right_Down_Curve();
    Check_2D_Busy();
}

void Draw_Right_Down_Curve_Fill(
    unsigned long ForegroundColor // ForegroundColor: Set Curve or Curve Fill color
    /*ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short X_R // Radius Width of Curve
    ,
    unsigned short Y_R // Radius Length of Curve
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Ellipse_Center_XY(XCenter, YCenter);
    Ellipse_Radius_RxRy(X_R, Y_R);
    Start_Right_Down_Curve_Fill();
    Check_2D_Busy();
}

void Draw_Right_Up_Curve(
    unsigned long ForegroundColor // ForegroundColor: Set Curve or Curve Fill color
    /*ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short X_R // Radius Width of Curve
    ,
    unsigned short Y_R // Radius Length of Curve
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Ellipse_Center_XY(XCenter, YCenter);
    Ellipse_Radius_RxRy(X_R, Y_R);
    Start_Right_Up_Curve();
    Check_2D_Busy();
}

void Draw_Right_Up_Curve_Fill(
    unsigned long ForegroundColor // ForegroundColor: Set Curve or Curve Fill color
    /*ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short X_R // Radius Width of Curve
    ,
    unsigned short Y_R // Radius Length of Curve
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Ellipse_Center_XY(XCenter, YCenter);
    Ellipse_Radius_RxRy(X_R, Y_R);
    Start_Right_Up_Curve_Fill();
    Check_2D_Busy();
}

void Draw_Left_Down_Curve(
    unsigned long ForegroundColor // ForegroundColor: Set Curve or Curve Fill color
    /*ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short X_R // Radius Width of Curve
    ,
    unsigned short Y_R // Radius Length of Curve
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Ellipse_Center_XY(XCenter, YCenter);
    Ellipse_Radius_RxRy(X_R, Y_R);
    Start_Left_Down_Curve();
    Check_2D_Busy();
}

void Draw_Left_Down_Curve_Fill(
    unsigned long ForegroundColor // ForegroundColor: Set Curve or Curve Fill color
    /*ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short XCenter // coordinate X of Center
    ,
    unsigned short YCenter // coordinate Y of Center
    ,
    unsigned short X_R // Radius Width of Curve
    ,
    unsigned short Y_R // Radius Length of Curve
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Ellipse_Center_XY(XCenter, YCenter);
    Ellipse_Radius_RxRy(X_R, Y_R);
    Start_Left_Down_Curve_Fill();
    Check_2D_Busy();
}

