gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
void Draw_Square(
    unsigned long ForegroundColor
    /*ForegroundColor: Set Curve or Curve Fill color. ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short X1 // X of point1 coordinate
    ,
    unsigned short Y1 // Y of point1 coordinate
    ,
    unsigned short X2 // X of point2 coordinate
    ,
    unsigned short Y2 // Y of point2 coordinate
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Square_Start_XY(X1, Y1);
    Square_End_XY(X2, Y2);
    Start_Square();
    Check_2D_Busy();
}

void Draw_Square_Fill(
    unsigned long ForegroundColor
    /*ForegroundColor: Set Curve or Curve Fill color. ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short X1 // X of point1 coordinate
    ,
    unsigned short Y1 // Y of point1 coordinate
    ,
    unsigned short X2 // X of point2 coordinate
    ,
    unsigned short Y2 // Y of point2 coordinate
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Square_Start_XY(X1, Y1);
    Square_End_XY(X2, Y2);
    Start_Square_Fill();
    Check_2D_Busy();
}

void Draw_Circle_Square(
    unsigned long ForegroundColor
    /*ForegroundColor : Set Circle Square color. ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short X1 // X of point1 coordinate
    ,
    unsigned short Y1 // Y of point1 coordinate
    ,
    unsigned short X2 // X of point2 coordinate
    ,
    unsigned short Y2 // Y of point2 coordinate
    ,
    unsigned short X_R // Radius Width of Circle Square
    ,
    unsigned short Y_R // Radius Length of Circle Square
)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Square_Start_XY(X1, Y1);
    Square_End_XY(X2, Y2);
    Circle_Square_Radius_RxRy(X_R, Y_R);
    Start_Circle_Square();
    Check_2D_Busy();
}

void Draw_Circle_Square_Fill(
    unsigned long ForegroundColor
    /*ForegroundColor : Set Circle Square color. ForegroundColor Color dataformat :
    ColorDepth_8bpp : R3G3B2ColorDepth_16bpp : R5G6B5ColorDepth_24bpp : R8G8B8*/
    ,
    unsigned short X1 // X of point1 coordinate
    ,
    unsigned short Y1 // Y of point1 coordinate
    ,
    unsigned short X2 // X of point2 coordinate
    ,
    unsigned short Y2 // Y of point2 coordinate
    ,
    unsigned short X_R // Radius Width of Circle Square
    ,
    unsigned short Y_R // Radius Length of Circle Square
)
{

#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(ForegroundColor);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(ForegroundColor);
#endif
    Square_Start_XY(X1, Y1);
    Square_End_XY(X2, Y2);
    Circle_Square_Radius_RxRy(X_R, Y_R);
    Start_Circle_Square_Fill();
    Check_2D_Busy();
}

void BTE_Pattern_Fill(
    unsigned char P_8x8_or_16x16 // 0 : use 8x8 Icon , 1 : use 16x16 Icon.
    ,
    unsigned long S0_Addr // Start address of Source 0
    ,
    unsigned short S0_W // image width of Source 0 (recommend = canvas image width)
    ,
    unsigned short XS0 // coordinate X of Source 0
    ,
    unsigned short YS0 // coordinate Y of Source 0
    ,
    unsigned long S1_Addr // Start address of Source 1
    ,
    unsigned short S1_W // image width of Source 1 (recommend = canvas image width)
    ,
    unsigned short XS1 // coordinate X of Source 1
    ,
    unsigned short YS1 // coordinate Y of Source 1
    ,
    unsigned long Des_Addr // start address of Destination
    ,
    unsigned short Des_W // image width of Destination (recommend = canvas image width)
    ,
    unsigned short XDes // coordinate X of Destination
    ,
    unsigned short YDes // coordinate Y of Destination
    ,
    unsigned int ROP_Code
    /*ROP_Code :
       0000b		0(Blackness)
       0001b		~S0!E~S1 or ~(S0+S1)
       0010b		~S0!ES1
       0011b		~S0
       0100b		S0!E~S1
       0101b		~S1
       0110b		S0^S1
       0111b		~S0 + ~S1 or ~(S0 + S1)
       1000b		S0!ES1
       1001b		~(S0^S1)
       1010b		S1
       1011b		~S0+S1
       1100b		S0
       1101b		S0+~S1
       1110b		S0+S1
       1111b		1(whiteness)*/
    ,
    unsigned short X_W // Width of BTE Winodw
    ,
    unsigned short Y_H // Length of BTE Winodw
)
{
    if (P_8x8_or_16x16 == 0) {
        Pattern_Format_8X8();
    }
    if (P_8x8_or_16x16 == 1) {
        Pattern_Format_16X16();
    }
    BTE_S0_Memory_Start_Address(S0_Addr);
    BTE_S0_Image_Width(S0_W);
    BTE_S0_Window_Start_XY(XS0, YS0);

