gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
    BTE_Operation_Code(0x05); // BTE Operation: Memory copy (move) with chroma keying (w/o ROP)
    BTE_Window_Size(X_W, Y_H);
    BTE_Enable();
    Check_BTE_Busy();
}

void BTE_MCU_Write_MCU_8bit(
    unsigned long S1_Addr // Start address of Source 1
    ,
    unsigned short S1_W // image width of Source 1 (recommend = canvas image width)
    ,
    unsigned short XS1 // coordinate X of Source 1
    ,
    unsigned short YS1 // coordinate Y of Source 1
    ,
    unsigned long Des_Addr // start address of Destination
    ,
    unsigned short Des_W // image width of Destination (recommend = canvas image width)
    ,
    unsigned short XDes // coordinate X of Destination
    ,
    unsigned short YDes // coordinate Y of Destination
    ,
    unsigned int ROP_Code
    /*ROP_Code :
       0000b		0(Blackness)
       0001b		~S0!E~S1 or ~(S0+S1)
       0010b		~S0!ES1
       0011b		~S0
       0100b		S0!E~S1
       0101b		~S1
       0110b		S0^S1
       0111b		~S0 + ~S1 or ~(S0 + S1)
       1000b		S0!ES1
       1001b		~(S0^S1)
       1010b		S1
       1011b		~S0+S1
       1100b		S0
       1101b		S0+~S1
       1110b		S0+S1
       1111b		1(whiteness)*/
    ,
    unsigned short X_W // Width of BTE Window
    ,
    unsigned short Y_H // Length of BTE Window
    ,
    const unsigned char *data_array // 8-bit data
)
{
    unsigned short i, j;

    BTE_S1_Memory_Start_Address(S1_Addr);
    BTE_S1_Image_Width(S1_W);
    BTE_S1_Window_Start_XY(XS1, YS1);

    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);

    BTE_Window_Size(X_W, Y_H);
    BTE_ROP_Code(ROP_Code);
    BTE_Operation_Code(0x00); // BTE Operation: MPU Write with ROP.
    BTE_Enable();
    LCD_CmdWrite(0x04); // Memory Data Read/Write Port
#ifdef MCU_8bit_ColorDepth_8bpp

    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < (X_W); j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

#ifdef MCU_8bit_ColorDepth_16bpp
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < (X_W * 2); j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

#ifdef MCU_8bit_ColorDepth_24bpp
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < (X_W * 3); j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif
}

void BTE_MCU_Write_MCU_16bit(
    unsigned long S1_Addr // Start address of Source 1
    ,
    unsigned short S1_W // image width of Source 1 (recommend = canvas image width)
    ,
    unsigned short XS1 // coordinate X of Source 1
    ,
    unsigned short YS1 // coordinate Y of Source 1
    ,
    unsigned long Des_Addr // start address of Destination
    ,
    unsigned short Des_W // image width of Destination (recommend = canvas image width)
    ,
    unsigned short XDes // coordinate X of Destination
    ,
    unsigned short YDes // coordinate Y of Destination
    ,
    unsigned int ROP_Code
    /*ROP_Code :
       0000b		0(Blackness)
       0001b		~S0!E~S1 or ~(S0+S1)
       0010b		~S0!ES1
       0011b		~S0
       0100b		S0!E~S1
       0101b		~S1
       0110b		S0^S1
       0111b		~S0 + ~S1 or ~(S0 + S1)
       1000b		S0!ES1
       1001b		~(S0^S1)
       1010b		S1
       1011b		~S0+S1
       1100b		S0
       1101b		S0+~S1
       1110b		S0+S1
       1111b		1(whiteness)*/
    ,
    unsigned short X_W // Width of BTE Window
    ,
    unsigned short Y_H // Length of BTE Window
    ,
    const unsigned short *data_array // 16-bit data
)
{
    unsigned short i, j;

    BTE_S1_Memory_Start_Address(S1_Addr);
    BTE_S1_Image_Width(S1_W);
    BTE_S1_Window_Start_XY(XS1, YS1);

    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);

    BTE_Window_Size(X_W, Y_H);
    BTE_ROP_Code(ROP_Code);
    BTE_Operation_Code(0x00); // BTE Operation: MPU Write with ROP.
    BTE_Enable();
    LCD_CmdWrite(0x04); // Memory Data Read/Write Port
#ifdef MCU_16bit_ColorDepth_16bpp
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < (X_W); j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite((*data_array));
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < (X_W / 2); j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < (X_W); j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

    Check_BTE_Busy();
}

void BTE_MCU_Write_Chroma_key_MCU_8bit(
    unsigned long Des_Addr // start address of Destination
    ,
    unsigned short Des_W // image width of Destination (recommend = canvas image width)
    ,
    unsigned short XDes // coordinate X of Destination
    ,
    unsigned short YDes // coordinate Y of Destination
    ,
    unsigned long Background_color // transparency color
    ,
    unsigned short X_W // Width of BTE Window
    ,
    unsigned short Y_H // Length of BTE Window
    ,
    const unsigned char *data_array // 8-bit data
)
{
    unsigned short i, j;

#ifdef MCU_8bit_ColorDepth_8bpp
    Background_color_256(Background_color);
#endif

#ifdef MCU_8bit_ColorDepth_16bpp
    Background_color_65k(Background_color);
#endif

#ifdef MCU_8bit_ColorDepth_24bpp
    Background_color_16M(Background_color);
#endif
    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);

    BTE_Window_Size(X_W, Y_H);
    BTE_Operation_Code(0x04); // BTE Operation: MPU Write w/ chroma keying (w/o ROP)
    BTE_Enable();

