gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
    LCD_CmdWrite(0x04); // Memory Data Read/Write Port

#ifdef MCU_8bit_ColorDepth_8bpp

    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < (X_W); j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

#ifdef MCU_8bit_ColorDepth_16bpp
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < (X_W * 2); j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

#ifdef MCU_8bit_ColorDepth_24bpp
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < (X_W * 3); j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif
    Check_BTE_Busy();
}

void BTE_MCU_Write_Chroma_key_MCU_16bit(
    unsigned long Des_Addr // start address of Destination
    ,
    unsigned short Des_W // image width of Destination (recommend = canvas image width)
    ,
    unsigned short XDes // coordinate X of Destination
    ,
    unsigned short YDes // coordinate Y of Destination
    ,
    unsigned long Background_color // transparency color
    ,
    unsigned short X_W // Width of BTE Window
    ,
    unsigned short Y_H // Length of BTE Window
    ,
    const unsigned short *data_array // 16-bit data
)
{
    unsigned int i, j;

#ifdef MCU_16bit_ColorDepth_16bpp // setting in UserDef.h
    Background_color_65k(Background_color);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1 // setting in UserDef.h
    Background_color_16M(Background_color);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2 // setting in UserDef.h
    Background_color_16M(Background_color);
#endif
    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);

    BTE_Window_Size(X_W, Y_H);
    BTE_Operation_Code(0x04); // BTE Operation: MPU Write with chroma keying (w/o ROP)
    BTE_Enable();
    LCD_CmdWrite(0x04);           // Memory Data Read/Write Port
#ifdef MCU_16bit_ColorDepth_16bpp // setting in UserDef.h

    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < X_W; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1 // setting in UserDef.h
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < (X_W / 2); j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2 // setting in UserDef.h
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < (X_W); j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

    Check_BTE_Busy();
}

/*
No support 24bpp color depth
S0_Addr : Source 0 Start address
S0_W : Source 0 image width(recommend = canvas image width)
XS0 : Source 0 coordinate of X
YS0 : Source 0 coordinate of Y
Des_Addr : Destination start address
Des_W :	 Destination image width(recommend = canvas image width)
XDes : Destination coordinate of X
YDes : Destination coordinate of Y
X_W : BTE Window Size of X
Y_H : BTE Window Size of Y
Foreground_color : The source (1bit map picture) map data 1 translate to Foreground color by color expansion
Background_color : The source (1bit map picture) map data 0 translate to background color by color expansion
*/
void BTE_Memory_Copy_ColorExpansion(unsigned long S0_Addr, unsigned short S0_W, unsigned short XS0, unsigned short YS0, unsigned long Des_Addr, unsigned short Des_W, unsigned short XDes, unsigned short YDes, unsigned short X_W, unsigned short Y_H, unsigned long Foreground_color, unsigned long Background_color)
{

#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(Foreground_color);
    Background_color_256(Background_color);
    BTE_ROP_Code(7); // MCU data bus width: 8bit, ROP Code=7
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(Foreground_color);
    Background_color_65k(Background_color);
    BTE_ROP_Code(15); // MCU data bus width: 8bit, ROP Code=7
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(Foreground_color);
    Background_color_65k(Background_color);
    BTE_ROP_Code(15); // MCU data bus width: 16bit, ROP Code=7
#endif

    BTE_S0_Memory_Start_Address(S0_Addr);
    BTE_S0_Image_Width(S0_W);
    BTE_S0_Window_Start_XY(XS0, YS0);

    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);

    BTE_Window_Size(X_W, Y_H);
    BTE_Operation_Code(0xE); // BTE Operation: Memory write with Color Expansion (w/o ROP)

#ifdef MCU_8bit_ColorDepth_8bpp
    BTE_Enable();
    Check_BTE_Busy();
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    BTE_Enable();
    Check_BTE_Busy();
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    BTE_Enable();
    Check_BTE_Busy();
#endif
}

/*
No support 24bpp color depth
S0_Addr : Source 0 Start address
S0_W : Source 0 image width(recommend = canvas image width)
XS0 : Source 0 coordinate of X
YS0 : Source 0 coordinate of Y
Des_Addr : Destination start address
Des_W :	 Destination image width(recommend = canvas image width)
XDes : Destination coordinate of X
YDes : Destination coordinate of Y
X_W : BTE Window Size of X
Y_H : BTE Window Size of Y
Foreground_color : The source (1bit map picture) map data 1 translate to Foreground color by color expansion
*/
void BTE_Memory_Copy_ColorExpansion_Chroma_key(unsigned long S0_Addr, unsigned short S0_W, unsigned short XS0, unsigned short YS0, unsigned long Des_Addr, unsigned short Des_W, unsigned short XDes, unsigned short YDes, unsigned short X_W, unsigned short Y_H, unsigned long Foreground_color)
{
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(Foreground_color);
    BTE_ROP_Code(7); // MCU data bus width: 8bit, ROP Code=7
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(Foreground_color);
    BTE_ROP_Code(15); // MCU data bus width: 8bit, ROP Code=7
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(Foreground_color);
    BTE_ROP_Code(15); // MCU data bus width: 16bit, ROP Code=7
#endif

