gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
    BTE_S0_Memory_Start_Address(S0_Addr);
    BTE_S0_Image_Width(S0_W);
    BTE_S0_Window_Start_XY(XS0, YS0);

    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);

    BTE_Window_Size(X_W, Y_H);
    BTE_Operation_Code(0xF); // BTE Operation: Memory write with Color Expansion and chroma keying (w/o ROP)

#ifdef MCU_8bit_ColorDepth_8bpp
    BTE_Enable();
    Check_BTE_Busy();
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    BTE_Enable();
    Check_BTE_Busy();
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    BTE_Enable();
    Check_BTE_Busy();
#endif
}

void BTE_MCU_Write_ColorExpansion_MCU_8bit(
    unsigned long Des_Addr // start address of Destination
    ,
    unsigned short Des_W // image width of Destination (recommend = canvas image width)
    ,
    unsigned short XDes // coordinate X of Destination
    ,
    unsigned short YDes // coordinate Y of Destination
    ,
    unsigned short X_W // Width of BTE Window
    ,
    unsigned short Y_H // Length of BTE Window
    ,
    unsigned long Foreground_color
    /*Foreground_color : The source (1bit map picture) map data 1 translate to Foreground color by color expansion*/
    ,
    unsigned long Background_color
    /*Background_color : The source (1bit map picture) map data 0 translate to Foreground color by color expansion*/
    ,
    const unsigned char *data_array // 8-bit data
)
{
    unsigned short i, j;

    /* set BTE Parameters and Run */
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(Foreground_color);
    Background_color_256(Background_color);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(Foreground_color);
    Background_color_65k(Background_color);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(Foreground_color);
    Background_color_16M(Background_color);
#endif

    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);

    BTE_ROP_Code(7); // MCU data bus width: 8bit, ROP Code=7
    BTE_Window_Size(X_W, Y_H);
    BTE_Operation_Code(0x8); // BTE Operation: MPU Write with Color Expansion (w/o ROP)

    BTE_Enable();

    LCD_CmdWrite(0x04); // Memory Data Read/Write Port

    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < X_W / 8; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();

    Check_BTE_Busy();
}

void BTE_MCU_Write_ColorExpansion_MCU_16bit(
    unsigned long Des_Addr // start address of Destination
    ,
    unsigned short Des_W // image width of Destination (recommend = canvas image width)
    ,
    unsigned short XDes // coordinate X of Destination
    ,
    unsigned short YDes // coordinate Y of Destination
    ,
    unsigned short X_W // Width of BTE Window
    ,
    unsigned short Y_H // Length of BTE Window
    ,
    unsigned long Foreground_color
    /*Foreground_color : The source (1bit map picture) map data 1 translate to Foreground color by color expansion*/
    ,
    unsigned long Background_color
    /*Background_color : The source (1bit map picture) map data 0 translate to Background color by color expansion*/
    ,
    const unsigned short *data_array // 16-bit data
)
{
    unsigned short i, j;

#ifdef MCU_16bit_ColorDepth_16bpp
    Data_Format_16b_16bpp();
    Foreground_color_65k(Foreground_color);
    Background_color_65k(Background_color);
    BTE_ROP_Code(15);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Data_Format_16b_8bpp();
    Foreground_color_16M(Foreground_color);
    Background_color_16M(Background_color);
    BTE_ROP_Code(7);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Data_Format_16b_8bpp();
    Foreground_color_16M(Foreground_color);
    Background_color_16M(Background_color);
    BTE_ROP_Code(7);
#endif

    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);

    BTE_Window_Size(X_W, Y_H);
    BTE_Operation_Code(0x8); // BTE Operation: MPU Write with Color Expansion (w/o ROP)
    BTE_Enable();

#ifdef MCU_16bit_ColorDepth_16bpp
    LCD_CmdWrite(0x04); // Memory Data Read/Write Port
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < X_W / 16; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    LCD_CmdWrite(0x04); // Memory Data Read/Write Port
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < X_W / 16; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array >> 8);

            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    LCD_CmdWrite(0x04); // Memory Data Read/Write Port
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < X_W / 16; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array >> 8);

            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

    Check_BTE_Busy();

#ifdef MCU_16bit_ColorDepth_16bpp
    Data_Format_16b_16bpp();
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Data_Format_16b_24bpp_mode1();
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Data_Format_16b_24bpp_mode2();
#endif
}

void BTE_MCU_Write_ColorExpansion_Chroma_key_MCU_8bit(
    unsigned long Des_Addr // start address of Destination
    ,
    unsigned short Des_W // image width of Destination (recommend = canvas image width)
    ,
    unsigned short XDes // coordinate X of Destination
    ,
    unsigned short YDes // coordinate Y of Destination
    ,
    unsigned short X_W // Width of BTE Window
    ,
    unsigned short Y_H // Length of BTE Window
    ,
    unsigned long Foreground_color
    /*Foreground_color : The source (1bit map picture) map data 1 translate to Foreground color by color expansion*/
    ,
    const unsigned char *data_array // 8-bit data
)
{
    unsigned short i, j;

    //  Data_Format_8b_8bpp();

    /* set BTE Parameters and Run */
#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(Foreground_color);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(Foreground_color);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(Foreground_color);
#endif

    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);

