gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
    BTE_ROP_Code(7); // MCU data bus width: 8bit, ROP Code=7
    BTE_Window_Size(X_W, Y_H);
    BTE_Operation_Code(0x9); // BTE Operation: MPU Write with Color Expansion and chroma keying (w/o ROP)

    BTE_Enable();

    LCD_CmdWrite(0x04); // Memory Data Read/Write Port

    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < X_W / 8; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();

    Check_BTE_Busy();
}

void BTE_MCU_Write_ColorExpansion_Chroma_key_MCU_16bit(
    unsigned long Des_Addr // start address of Destination
    ,
    unsigned short Des_W // image width of Destination (recommend = canvas image width)
    ,
    unsigned short XDes // coordinate X of Destination
    ,
    unsigned short YDes // coordinate Y of Destination
    ,
    unsigned short X_W // Width of BTE Window
    ,
    unsigned short Y_H // Length of BTE Window
    ,
    unsigned long Foreground_color
    /*Foreground_color : The source (1bit map picture) map data 1 translate to Foreground color by color expansion*/
    ,
    const unsigned short *data_array // 16-bit data
)
{
    unsigned short i, j;

#ifdef MCU_16bit_ColorDepth_16bpp
    Data_Format_16b_16bpp();
    Foreground_color_65k(Foreground_color);
    BTE_ROP_Code(15);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Data_Format_16b_8bpp();
    Foreground_color_16M(Foreground_color);
    BTE_ROP_Code(7);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Data_Format_16b_8bpp();
    Foreground_color_16M(Foreground_color);
    BTE_ROP_Code(7);
#endif

    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);

    BTE_Window_Size(X_W, Y_H);
    BTE_Operation_Code(0x9); // BTE Operation: MPU Write with Color Expansion and chroma keying (w/o ROP)
    BTE_Enable();
    LCD_CmdWrite(0x04); // Memory Data Read/Write Port

#ifdef MCU_16bit_ColorDepth_16bpp // setting in UserDef.h
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < X_W / 16; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1 // setting in UserDef.h
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < X_W / 16; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array >> 8);

            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif

#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2 // setting in UserDef.h
    for (i = 0; i < Y_H; i++) {
        for (j = 0; j < X_W / 16; j++) {
            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array >> 8);

            Check_Mem_WR_FIFO_not_Full();
            LCD_DataWrite(*data_array);
            data_array++;
        }
    }
    Check_Mem_WR_FIFO_Empty();
#endif
    Check_BTE_Busy();
}

void BTE_Solid_Fill(
    unsigned long Des_Addr // start address of destination
    ,
    unsigned short Des_W // image width of destination (recommend = canvas image width)
    ,
    unsigned short XDes // coordinate X of destination
    ,
    unsigned short YDes // coordinate Y of destination
    ,
    unsigned long Foreground_color // Solid Fill color
    ,
    unsigned short X_W // Width of BTE Window
    ,
    unsigned short Y_H // Length of BTE Window
)
{

#ifdef MCU_8bit_ColorDepth_8bpp
    Foreground_color_256(Foreground_color);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    Foreground_color_65k(Foreground_color);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    Foreground_color_16M(Foreground_color);
#endif

#ifdef MCU_16bit_ColorDepth_16bpp
    Foreground_color_65k(Foreground_color);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
    Foreground_color_16M(Foreground_color);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    Foreground_color_16M(Foreground_color);
#endif
    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);
    BTE_Window_Size(X_W, Y_H);
    BTE_Operation_Code(0x0c); // BTE Operation: Solid Fill (w/o ROP)
    BTE_Enable();
    Check_BTE_Busy();
}

/*
S0_Addr : Source 0 Start address
S0_W : Source 0 image width(recommend = canvas image width)
XS0 : Source 0 coordinate of X
YS0 : Source 0 coordinate of Y
S1_Addr : Source 1 Start address
S1_W : Source 1 image width(recommend = canvas image width)
XS1 : Source 1 coordinate of X
YS1 : Source 1 coordinate of Y
Des_Addr : Destination start address
Des_W :	 Destination image width(recommend = canvas image width)
XDes : Destination coordinate of X
YDes : Destination coordinate of Y
X_W : BTE Window Size of X
Y_H : BTE Window Size of Y
alpha : Alpha Blending effect 0 ~ 32, Destination data = (Source 0 * (1- alpha)) + (Source 1 * alpha)
*/
void BTE_Alpha_Blending_Picture_Mode(unsigned long S0_Addr, unsigned short S0_W, unsigned short XS0, unsigned short YS0, unsigned long S1_Addr, unsigned short S1_W, unsigned short XS1, unsigned short YS1, unsigned long Des_Addr, unsigned short Des_W, unsigned short XDes, unsigned short YDes, unsigned short X_W, unsigned short Y_H, unsigned char alpha)
{
    BTE_S0_Memory_Start_Address(S0_Addr);
    BTE_S0_Image_Width(S0_W);
    BTE_S0_Window_Start_XY(XS0, YS0);

    BTE_S1_Memory_Start_Address(S1_Addr);
    BTE_S1_Image_Width(S1_W);
    BTE_S1_Window_Start_XY(XS1, YS1);

    BTE_Destination_Memory_Start_Address(Des_Addr);
    BTE_Destination_Image_Width(Des_W);
    BTE_Destination_Window_Start_XY(XDes, YDes);

    BTE_Window_Size(X_W, Y_H);
    BTE_Operation_Code(0x0A); // BTE Operation: Memory write with opacity (w/o ROP)
    BTE_Alpha_Blending_Effect(alpha);
    BTE_Enable();
    Check_BTE_Busy();
}

//void DMA_24bit(uint8_t clk, uint16_t x1, uint16_t y1, uint16_t Wx, uint16_t Hy, uint16_t picwidth, uint32_t addr);
void DMA_24bit(
    unsigned char Clk // Clk : SPI Clock = System Clock /{(Clk)*2} , SPI CLK recommend <=90MHz
    ,
    unsigned short X1 // X of DMA Coordinate
    ,
    unsigned short Y1 // Y of DMA Coordinate
    ,
    unsigned short X_W // DMA Block width
    ,
    unsigned short Y_H // DMA Block height
    ,
    unsigned short P_W // DMA Picture width
    ,
    unsigned long Addr // DMA Source Start address
)
{
    SPIM_Clock_Divided_1();                // SPI Clock = System Clock /{(Clk)*2}
    SPI_Master_LatchEdge_Select_Falling(); // SPIM latch

    Select_SFI_DMA_Mode(); // Set Serial Flash DMA Mode
    SPI_Clock_Period(Clk);
    /////////////////////////////////////////****************DMA
    Goto_Pixel_XY(X1, Y1);                         // set Memory coordinate in Graphic Mode
    SFI_DMA_Destination_Upper_Left_Corner(X1, Y1); // DMA Destination position(x,y)
    SFI_DMA_Transfer_Width_Height(X_W, Y_H);       // Set DMA Block (Height , Width)
    SFI_DMA_Source_Width(P_W);                     // Set DMA Source Picture Width
    SFI_DMA_Source_Start_Address(Addr);            // Set Serial Flash DMA Source Starting Address

    Start_SFI_DMA();      // Start DMA
    Check_Busy_SFI_DMA(); // DMA Busy Check
}

