gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
//void DMA_32bit(uint8_t clk, uint16_t x1, uint16_t y1, uint16_t Wx, uint16_t Hy, uint16_t picwidth, uint32_t addr);
void DMA_32bit(
    unsigned char Clk // Clk : SPI Clock = System Clock /{(Clk+1)*2}
    ,
    unsigned short X1 // X of DMA Coordinate
    ,
    unsigned short Y1 // Y of DMA Coordinate
    ,
    unsigned short X_W // DMA Block width
    ,
    unsigned short Y_H // DMA Block height
    ,
    unsigned short P_W // DMA Picture width
    ,
    unsigned long Addr // DMA Source Start address
)
{

    //  Enable_SFlash_SPI();									   //Enable Serial Flash
    Select_SFI_DMA_Mode(); // Set Serial Flash DMA Mode
    SPI_Clock_Period(Clk);

    Select_SFI_32bit_Address(); // Set Serial Flash/ROM 32bits Address
    /////////////////////////////////////////****************DMA
    Goto_Pixel_XY(X1, Y1);                         // set Memory coordinate in Graphic Mode
    SFI_DMA_Destination_Upper_Left_Corner(X1, Y1); // DMA Destination position(x,y)
    SFI_DMA_Transfer_Width_Height(X_W, Y_H);       // Set DMA Block (Height , Width)
    SFI_DMA_Source_Width(P_W);                     // Set DMA Source Picture Width
    SFI_DMA_Source_Start_Address(Addr);            // Set Serial Flash DMA Source Starting Address

    Start_SFI_DMA();      // Start DMA
    Check_Busy_SFI_DMA(); // DMA Busy Check
    Select_SFI_24bit_Address();
}

//void Switch_24bitsTo32bits(uint8_t bus, uint8_t scs)
void switch_24bits_to_32bits(unsigned char BUS, unsigned char SCS)
{
    Enable_SFlash_SPI();
    SPI_Master_LatchEdge_Select_Falling();
    SPIM_Clock_Divided_1();
    SPI_Clock_Period(2);

    switch (BUS) {
        case 0:
            SPIM_Select_Bus_0();
            break;

        case 1:
            SPIM_Select_Bus_1();
            break;
    }

    if (SCS == 0) {
        Select_nSS_drive_on_xnsfcs0();
    }
    if (SCS == 1) {
        Select_nSS_drive_on_xnsfcs1();
    }
    if (SCS == 2) {
        Select_nSS_drive_on_xnsfcs2();
    }
    if (SCS == 3) {
        Select_nSS_drive_on_xnsfcs3();
    }
    //**************************//data are read on the clock's rising edge(low!鱤igh transition)
    //**************************//and data are changed on a falling edge (high!鱨ow clock transition)
    Reset_CPOL();
    // Set_CPOL();
    Reset_CPHA();
    // Set_CPHA();
    //**************************
    // Enter 4-byte mode

    nSS_Active(); // nSS port will goes low
    SPI_Master_FIFO_Data_Put(0xB7);

    delay_ms(1);
    nSS_Inactive(); // nSS port will goes high
}

//void PWM0(bool on_off, uint8_t clock_divided, uint8_t prescalar, uint16_t count_buffer, uint16_t compare_buffer);
void PWM0(
    unsigned char on_off // on_off = 1 ,enable PWM, on_off = 0 , disable PWM.
    ,
    unsigned char Clock_Divided // divided PWM clock, only 0~3(1,1/2,1/4,1/8)
    ,
    unsigned char Prescalar // Prescaler : only 1~256
    ,
    unsigned short Count_Buffer // Count_Buffer : set PWM output period time
    ,
    unsigned short Compare_Buffer // Compare_Buffer : set PWM output high level time(Duty cycle)
    /*Such as the following formula :
    PWM CLK = (Core CLK / Prescalar ) /2^ divided clock
    PWM output period = (Count Buffer + 1) x PWM CLK time
    PWM output high level time = (Compare Buffer + 1) x PWM CLK time */
)
{
    Select_PWM0();
    Set_PWM_Prescaler_1_to_256(Prescalar);

    if (Clock_Divided == 0) {
        Select_PWM0_Clock_Divided_By_1();
    }
    if (Clock_Divided == 1) {
        Select_PWM0_Clock_Divided_By_2();
    }
    if (Clock_Divided == 2) {
        Select_PWM0_Clock_Divided_By_4();
    }
    if (Clock_Divided == 3) {
        Select_PWM0_Clock_Divided_By_8();
    }

    Set_Timer0_Count_Buffer(Count_Buffer);     // 砞﹚顶计
    Set_Timer0_Compare_Buffer(Compare_Buffer); // DUTY

    if (on_off == 1) {
        Start_PWM0();
    }
    if (on_off == 0) {
        Stop_PWM0();
    }
}

//void PWM1(bool on_off, uint8_t clock_divided, uint8_t prescalar, uint16_t count_buffer, uint16_t compare_buffer);
void PWM1(
    unsigned char on_off // on_off = 1 ,enable PWM, on_off = 0 , disable PWM.
    ,
    unsigned char Clock_Divided // divided PWM clock, only 0~3(1,1/2,1/4,1/8)
    ,
    unsigned char Prescalar // Prescaler : only 1~256
    ,
    unsigned short Count_Buffer // Count_Buffer : set PWM output period time
    ,
    unsigned short Compare_Buffer // Compare_Buffer : set PWM output high level time(Duty cycle)
    /*Such as the following formula :
    PWM CLK = (Core CLK / Prescalar ) /2^ divided clock
    PWM output period = (Count Buffer + 1) x PWM CLK time
    PWM output high level time = (Compare Buffer + 1) x PWM CLK time */
)
{
    Select_PWM1();
    Set_PWM_Prescaler_1_to_256(Prescalar);

    if (Clock_Divided == 0) {
        Select_PWM1_Clock_Divided_By_1();
    }
    if (Clock_Divided == 1) {
        Select_PWM1_Clock_Divided_By_2();
    }
    if (Clock_Divided == 2) {
        Select_PWM1_Clock_Divided_By_4();
    }
    if (Clock_Divided == 3) {
        Select_PWM1_Clock_Divided_By_8();
    }

    Set_Timer1_Count_Buffer(Count_Buffer);     // 砞﹚顶计
    Set_Timer1_Compare_Buffer(Compare_Buffer); // DUTY

    if (on_off == 1) {
        Start_PWM1();
    }
    if (on_off == 0) {
        Stop_PWM1();
    }
}

// Note. this API does not support the case that MCU=16bit, 24bpp and mode1
void putPixel(
    unsigned short x // x of coordinate
    ,
    unsigned short y // y of coordinate
    ,
    unsigned long color
    /*color : 8bpp:R3G3B2
    16bpp:R5G6B5
    24bpp:R8G8B8 */
)

{

    Goto_Pixel_XY(x, y);
    LCD_CmdWrite(0x04);
    Check_Mem_WR_FIFO_not_Full();

#ifdef MCU_8bit_ColorDepth_8bpp
    LCD_DataWrite(color);
#endif
#ifdef MCU_8bit_ColorDepth_16bpp
    LCD_DataWrite(color);
    Check_Mem_WR_FIFO_not_Full();
    LCD_DataWrite(color >> 8);
#endif
#ifdef MCU_8bit_ColorDepth_24bpp
    LCD_DataWrite(color);
    Check_Mem_WR_FIFO_not_Full();
    LCD_DataWrite(color >> 8);
    Check_Mem_WR_FIFO_not_Full();
    LCD_DataWrite(color >> 16);
#endif
#ifdef MCU_16bit_ColorDepth_16bpp
    LCD_DataWrite(color);
#endif
#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
    LCD_DataWrite(color);
    Check_Mem_WR_FIFO_not_Full();
    LCD_DataWrite(color >> 16);
#endif
}


