gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
/////********************************
/*
BUS : select SPI Master bus 0 or 1
SCS : select SPI Master bus 0~3
buffer : AVI Shadow buffer
SCK_Divide : Media CLK = CORE CLK / (2^SCK_Divide) , Media CLK <= 60MHz (range : 0~2)
*/
/////********************************
//void SPI_NAND_initial_JPG_AVI(
//    unsigned char BUS // BUS : 0 = Use BUS0, 1 = Use BUS1
//    ,
//    unsigned char SCS // SCS : 0 = Use SCS0, 1 = Use SCS1 ,2 = Use SCS2 ,3 = Use SCS3
//    ,
//    unsigned char SCK_Divide // media decode divide : IDEC Clock = CORE CLK/2^SCK_Divide ,range:0~3, recommend <= 60MHz
//)
//{
//    Enable_SFlash_SPI();
//    SPI_Master_LatchEdge_Select_Falling();
//    SPIM_Clock_Divided_1();
//    IDEC_SPI_Clock_Divide(SCK_Divide);
//    SPI_Clock_Period(2);

//    switch (BUS) {
//        case 0:
//            IDEC_Select_Bus_0(); // MEDIA BUS 0
//            SPIM_Select_Bus_0();
//            break;

//        case 1:
//            IDEC_Select_Bus_1(); // MEDIA BUS 1
//            SPIM_Select_Bus_1();
//            break;
//    }

//    switch (SCS) {
//        case 0:
//            IDEC_Select_SFI_0(); // MEDIA CS0
//            Select_nSS_drive_on_xnsfcs0();
//            break;

//        case 1:
//            IDEC_Select_SFI_1(); // MEDIA CS1
//            Select_nSS_drive_on_xnsfcs1();
//            break;

//        case 2:
//            IDEC_Select_SFI_2(); // MEDIA CS2
//            Select_nSS_drive_on_xnsfcs2();
//            break;

//        case 3:
//            IDEC_Select_SFI_3(); // MEDIA CS3
//            Select_nSS_drive_on_xnsfcs3();
//            break;
//    }

//    Reset_CPOL();
//    // Set_CPOL();
//    Reset_CPHA();
//    // Set_CPHA();

//    W25N01_Device_Reset();
//    W25N01_Clear_BUF();
//    W25N01_Set_ECC();

//    IDEC_Select_SFI_24bit_Address();
//    IDEC_Select_RA8875_SPI_Mode0_and_Mode3();
//    IDEC_Select_SFI_Quad_Mode_Dummy_8T_6Bh(); // MEDIA QUAD MODE
//    // IDEC_Select_SFI_Quad_Mode_Dummy_4T_EBh();

//    IDEC_AVI_Decoding_to_PIP1_and_Shadow();
//}

/////********************************
/*
BUS : select SPI Master bus 0 or 1
SCS : select SPI Master bus 0~3
SCK_Divide : Media CLK = CORE CLK / (2^SCK_Divide) , Media CLK <= 60MHz
*/
/////********************************
//void SPI_NAND_initial_DMA(
//    unsigned char SCS // SCS : 0 = Use SCS0, 1 = Use SCS1 ,2 = Use SCS2 ,3 = Use SCS3
//    ,
//    unsigned char BUS // BUS : 0 = Use BUS0, 1 = Use BUS1
//)
//{
//    Enable_SFlash_SPI();
//    SPI_Master_LatchEdge_Select_Falling();
//    SPIM_Clock_Divided_1();
//    SPI_Clock_Period(2);

//    switch (BUS) {
//        case 0:
//            SPIM_Select_Bus_0();
//            FONT_DMA_Select_Bus_0();
//            break;

//        case 1:
//            SPIM_Select_Bus_1();
//            FONT_DMA_Select_Bus_1();
//            break;
//    }

//    switch (SCS) {
//        case 0:
//            Select_nSS_drive_on_xnsfcs0();
//            Select_SFI_0();
//            break;

//        case 1:
//            Select_nSS_drive_on_xnsfcs1();
//            Select_SFI_1();
//            break;

//        case 2:
//            Select_nSS_drive_on_xnsfcs2();
//            Select_SFI_2();
//            break;

//        case 3:
//            Select_nSS_drive_on_xnsfcs3();
//            Select_SFI_3();
//            break;
//    }

//    Reset_CPOL();
//    // Set_CPOL();
//    Reset_CPHA();
//    // Set_CPHA();

//    W25N01_Device_Reset();
//    W25N01_Clear_BUF();
//    W25N01_Set_ECC();

//    // Select_standard_SPI_Mode0_or_Mode3();
//    Select_RA8875_SPI_Mode0_and_Mode3();

//    //	Select_SFI_Single_Mode_Dummy_0T_03h();
//    //	Select_SFI_Single_Mode_Dummy_8T_0Bh();
//    //	Select_SFI_Single_Mode_Dummy_16T_1Bh();
//    //  Select_SFI_Dual_Mode_Dummy_8T_3Bh();
//    //	Select_SFI_Dual_Mode_Dummy_4T_BBh();
//    Select_SFI_Quad_Mode_Dummy_8T_6Bh();

//    Select_SFI_DMA_Mode();
//    Select_SFI_24bit_Address();
//}

/////********************************
/*
addr : Pic addr in flash
JPGsize : Pic size
x : write pic coordinate of x
y : write pic coordinate of y
*/
/////********************************
//void JPG_NAND(
//    unsigned long addr // Pic addr in flash
//    ,
//    unsigned long JPGsize // Pic size
//    ,
//    unsigned long IDEC_canvas_width // recommend = canvas_image_width
//    ,
//    unsigned short x // write pic coordinate of x
//    ,
//    unsigned short y // write pic coordinate of y
//)
//{
//    IDEC_Destination_Image_Width(IDEC_canvas_width);
//    IDEC_Destination_Upper_Left_Corner(x, y);

//    nSS_Active();
//    SPI_Master_FIFO_Data_Put(0x13);      // page data read(13h)
//    SPI_Master_FIFO_Data_Put(0x00);      // 8Dummy clock
//    SPI_Master_FIFO_Data_Put(addr >> 8); // page address MSB
//    SPI_Master_FIFO_Data_Put(addr);      // page address LSB
//    nSS_Inactive();
//    delay_ms(1); // delay for buffer load

//    IDEC_Source_Start_Address(addr); // JPG癬cl|i
//    IDEC_Transfer_Number(JPGsize);   // JPG SIZE
//    IDEC_Starts_Decoding();          //?}cl?NJPG
//    Check_Busy_Media_Decode();
//}

/////********************************
/*
addr : vedio addr in flash
vediosize : vedio size
x : show vedio coordinate of x
y : show vedio coordinate of y
height : vedio height
width : vedio width
*/
/////********************************
//void AVI_NAND(
//    unsigned long addr // vedio addr in flash
//    ,
//    unsigned long videosize // vedio size
//    ,
//    unsigned long shadow_buffer_addr // shadow buffer addr
//    ,
//    unsigned long PIP_buffer_addr // PIP buffer addr
//    ,
//    unsigned long x // show vedio coordinate of x
//    ,
//    unsigned long y // show vedio coordinate of y
//    ,
//    unsigned long height // vedio height
//    ,
//    unsigned long width // vedio width
//    ,
//    unsigned long PIP_canvas_Width // recommend = canvas_image_width
//)
//{
//    nSS_Active();
//    SPI_Master_FIFO_Data_Put(0x13);      // page data read(13h)
//    SPI_Master_FIFO_Data_Put(0x00);      // 8Dummy clock
//    SPI_Master_FIFO_Data_Put(addr >> 8); // page address MSB
//    SPI_Master_FIFO_Data_Put(addr);      // page address LSB
//    nSS_Inactive();
//    delay_ms(1); // delay for buffer load

//    IDEC_Source_Start_Address(addr);
//    IDEC_Transfer_Number(videosize); // AVI File Size
//    AVI_Shadow_PIP_Start_Address(shadow_buffer_addr);

//    Select_PIP1_Parameter();
//    PIP_Image_Start_Address(PIP_buffer_addr);
//    PIP_Display_Start_XY(x, y);
//    PIP_Image_Width(PIP_canvas_Width);
//    PIP_Window_Image_Start_XY(0, 0);
//    PIP_Window_Width_Height(width, height);
//    //	Enable_PIP1();

