gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
//    // Check_Vsync_finished();
//    IDEC_Starts_Decoding();
//    // Check_Busy_Media_Decode();
//}


//ON_OFF -> 0 : turn off AVI window, 1 :turn on AVI window
//void AVI_Window(bool on_off)
void AVI_window(unsigned char ON_OFF)
{
    if (ON_OFF == 0) {
        Disable_PIP1();
    }
    if (ON_OFF == 1) {
        Enable_PIP1();
    }
}

/*
PNG PIC : A(8)R(8)G(8)B(8) = 32bits
For BTE_alpha_blending_32bit_Pixel_mode
dma_page_addr : pic addr
pic_buffer_Layer : read pic buffer in sdram
Show_pic_Layer : show pic layer
*/
//void SPI_NAND_DMA_png(
//    unsigned long dma_page_addr // dma pic addr in flash
//    ,
//    unsigned long pic_buffer_Layer // pic_buffer_Layer : read pic buffer in sdram
//    ,
//    unsigned long Show_pic_Layer // Show_pic_Layer : write pic into sdram addr
//    ,
//    unsigned int picture_Width, unsigned int picture_Height)
//{

//    nSS_Active();
//    SPI_Master_FIFO_Data_Put(0x13);                 // page data read(13h)
//    SPI_Master_FIFO_Data_Put(0x00);                 // 8Dummy clock
//    SPI_Master_FIFO_Data_Put((dma_page_addr) >> 8); // page address MSB
//    SPI_Master_FIFO_Data_Put(dma_page_addr);        // page address LSB
//    nSS_Inactive();
//    delay_ms(1); // delay for buffer load

//    Memory_Linear_Mode();

//    SFI_DMA_Transfer_Number(picture_Width * picture_Height * 4); // picture Width x Height x Color depth(32bit = 4byte)
//    SFI_DMA_Destination_Start_Address(pic_buffer_Layer);         //

//    Start_SFI_DMA();
//    Check_2D_Busy();
//    Memory_XY_Mode();
//}

void SPI_NOR_DMA_png(
    unsigned long dma_page_addr // dma pic addr in flash
    ,
    unsigned long pic_buffer_Layer // pic_buffer_Layer : read pic buffer in sdram
    ,
    unsigned long Show_pic_Layer // Show_pic_Layer : write pic into sdram addr
    ,
    unsigned long picture_Width, unsigned long picture_Height)
{
    Memory_Linear_Mode();
    SFI_DMA_Source_Start_Address(dma_page_addr);
    SFI_DMA_Transfer_Number(picture_Width * picture_Height * 4); // picture Width x Height x Color depth(32bit = 4byte)
    SFI_DMA_Destination_Start_Address(pic_buffer_Layer);         //

    Start_SFI_DMA();
    Check_2D_Busy();
    Memory_XY_Mode();
}

/*
dma_page_addr : pic addr
pic_buffer_Layer : read pic buffer in sdram
Show_pic_Layer : show pic layer
X_coordinate : write to sdram coordinate of x
Y_coordinate : write to sdram coordinate of y
chorma : 0 = no transparent ,1 : Specify a color as transparent
Background_color : transparent color
*/
//void SPI_NAND_DMA(
//    unsigned long dma_page_addr // dma pic addr in flash
//    ,
//    unsigned long X_coordinate // pic write to sdram coordinate of x
//    ,
//    unsigned long Y_coordinate // pic write to sdram coordinate of y
//    ,
//    unsigned long des_canvas_width // recommend = canvas_image_width
//    ,
//    unsigned int picture_Width, unsigned int picture_Height, unsigned long pic_buffer_Layer // pic_buffer_Layer : read pic buffer in sdram
//    ,
//    unsigned long Show_pic_Layer // Show_pic_Layer : write pic into sdram addr
//    ,
//    unsigned char chorma // 0: no transparent,1:Specify a color as transparent
//    ,
//    unsigned long Background_color // transparent color
//)
//{

//#ifdef MCU_8bit_ColorDepth_8bpp
//    Background_color_256(Background_color);
//#endif
//#ifdef MCU_8bit_ColorDepth_16bpp
//    Background_color_65k(Background_color);
//#endif
//#ifdef MCU_8bit_ColorDepth_24bpp
//    Background_color_16M(Background_color);
//#endif
//#ifdef MCU_16bit_ColorDepth_16bpp
//    Background_color_65k(Background_color);
//#endif
//#ifdef MCU_16bit_ColorDepth_24bpp_Mode_1
//    Background_color_16M(Background_color);
//#endif
//#ifdef MCU_16bit_ColorDepth_24bpp_Mode_2
//    Background_color_16M(Background_color);
//#endif

//    nSS_Active();
//    SPI_Master_FIFO_Data_Put(0x13);                 // page data read(13h)
//    SPI_Master_FIFO_Data_Put(0x00);                 // 8Dummy clock
//    SPI_Master_FIFO_Data_Put((dma_page_addr) >> 8); // page address MSB
//    SPI_Master_FIFO_Data_Put(dma_page_addr);        // page address LSB
//    nSS_Inactive();
//    delay_ms(1); // delay for buffer load

//    Memory_Linear_Mode();
//    SFI_DMA_Source_Start_Address(dma_page_addr); // 24bit address

//#if defined MCU_8bit_ColorDepth_8bpp
//    SFI_DMA_Transfer_Number(picture_Width * picture_Height); // picture Width x Height x Color depth(8/8=1)
//#endif
//#if defined MCU_8bit_ColorDepth_16bpp
//    SFI_DMA_Transfer_Number(picture_Width * picture_Height * 2); // picture Width x Height x Color depth(16/8=2)
//#endif
//#if defined MCU_16bit_ColorDepth_16bpp
//    SFI_DMA_Transfer_Number(picture_Width * picture_Height * 2); // picture Width x Height x Color depth(16/8=2)
//#endif
//#if defined MCU_8bit_ColorDepth_24bpp
//    SFI_DMA_Transfer_Number(picture_Width * picture_Height * 3); // picture Width x Height x Color depth(24/8=3)
//#endif
//#if defined MCU_16bit_ColorDepth_24bpp_Mode_1
//    SFI_DMA_Transfer_Number(picture_Width * picture_Height * 3); // picture Width x Height x Color depth(24/8=3)
//#endif
//#if defined MCU_16bit_ColorDepth_24bpp_Mode_2
//    SFI_DMA_Transfer_Number(picture_Width * picture_Height * 3); // picture Width x Height x Color depth(24/8=3)
//#endif

//    SFI_DMA_Destination_Start_Address(pic_buffer_Layer); // DMA to Memory Address 1280*480*3

//    Start_SFI_DMA();
//    // Check_Busy_SFI_DMA();
//    Check_2D_Busy();

//    BTE_S0_Color_24bpp();
//    BTE_S0_Memory_Start_Address(pic_buffer_Layer); // S0 Address 1280*480*3
//    BTE_S0_Image_Width(picture_Width);
//    BTE_S0_Window_Start_XY(0, 0);

//    BTE_Destination_Color_24bpp();
//    BTE_Destination_Memory_Start_Address(Show_pic_Layer);
//    BTE_Destination_Image_Width(des_canvas_width);
//    BTE_Destination_Window_Start_XY(X_coordinate, Y_coordinate);

//    if (chorma == 0) {
//        BTE_ROP_Code(12);
//        BTE_Operation_Code(0x02);
//    }
//    if (chorma == 1) {
//        BTE_Operation_Code(0x05);
//    }

//    BTE_Window_Size(picture_Width, picture_Height);

