gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
//    BTE_Enable();

//    Check_BTE_Busy();

//    Memory_XY_Mode();
//}


/*
S0_Addr : Source 0 Start address
S0_W : Source 0 image width(recommend = canvas image width) 
XS0 : Source 0 coordinate of X
YS0 : Source 0 coordinate of Y
S1_Addr : Source 1 Start address
S1_W : Source 1 image width(recommend = canvas image width) 
XS1 : Source 1 coordinate of X
YS1 : Source 1 coordinate of Y
Des_Addr : Destination start address
Des_W :	 Destination image width(recommend = canvas image width) 
XDes : Destination coordinate of X
YDes : Destination coordinate of Y
X_W : BTE Window Size of X
Y_H : BTE Window Size of Y
*/
void BTE_alpha_blending_24bit_Pixel_mode(unsigned long S0_Addr,unsigned short S0_W,unsigned short XS0,unsigned short YS0,unsigned long S1_Addr,unsigned short S1_W,unsigned short XS1,unsigned short YS1,unsigned long Des_Addr,unsigned short Des_W, unsigned short XDes,unsigned short YDes,unsigned short X_W,unsigned short Y_H)
{
  BTE_S0_Color_24bpp();															//S0的色深选择
  BTE_S0_Memory_Start_Address(S0_Addr);
  BTE_S0_Image_Width(S0_W);
  BTE_S0_Window_Start_XY(XS0,YS0);									//S0与Des位置设定一样

  BTE_S1_Color_16bit_Alpha();												//选用16bpp，固定不变
  BTE_S1_Memory_Start_Address(S1_Addr);
  BTE_S1_Image_Width(S1_W); 
  BTE_S1_Window_Start_XY(XS1,YS1);
  
  BTE_Destination_Color_24bpp();										//Des的色深选择
  BTE_Destination_Memory_Start_Address(Des_Addr);
  BTE_Destination_Image_Width(Des_W);
  BTE_Destination_Window_Start_XY(XDes,YDes);

  BTE_Window_Size(X_W,Y_H);
  BTE_Operation_Code(0x0A);		//BTE Operation: Memory write with opacity (w/o ROP)
  BTE_Enable();
  Check_BTE_Busy();
}


/*
use for linear mode ,nand flash,
BTE_X : BTE window Width
BTE_Y : BTE window Height
S0X : source 0 coordinate of x
S0Y : source 0 coordinate of y
desX :destination coordinate of x
desY :destination coordinate of y
pic_buffer_Layer : read pic buffer addr in sdram
*/
void BTE_alpha_blending_32bit_Pixel_mode(
    unsigned int picture_Width // pic width
    ,
    unsigned int BTE_X // BTE window Width
    ,
    unsigned int BTE_Y // BTE window Height
    ,
    unsigned long S0X // source 0 coordinate of x
    ,
    unsigned long S0Y // source 0 coordinate of y
    ,
    unsigned long S0_Start_Addr // source 0 start addr
    ,
    unsigned long S0_canvas_width // recomamnd = canvas_image_width
    ,
    unsigned long desX // Destination coordinate of x
    ,
    unsigned long desY // Destination coordinate of y
    ,
    unsigned long DES_Start_Addr // Destination start addr
    ,
    unsigned long DES_canvas_width // recomamnd = canvas_image_width
    ,
    unsigned long pic_buffer_Layer // source 1 pic addr
)
{
    BTE_S0_Color_24bpp();
    BTE_S0_Memory_Start_Address(S0_Start_Addr);
    BTE_S0_Image_Width(S0_canvas_width);

    BTE_S1_Color_32bit_Alpha();
    BTE_S1_Memory_Start_Address(pic_buffer_Layer);
    BTE_S1_Image_Width(picture_Width); // ARGB

    BTE_Destination_Color_24bpp();
    BTE_Destination_Memory_Start_Address(DES_Start_Addr);
    BTE_Destination_Image_Width(DES_canvas_width);

    BTE_S1_Window_Start_XY(0, 0);
    BTE_S0_Window_Start_XY(S0X, S0Y);
    BTE_Destination_Window_Start_XY(desX, desY);
    BTE_Window_Size(BTE_X, BTE_Y);
    BTE_ROP_Code(12);
    BTE_Operation_Code(0x0A);
    BTE_Enable();
    Check_BTE_Busy();

    BTE_S1_Color_24bpp();
}

void SPI_NOR_Flash_switch_QUAD_MODE(
    unsigned char BUS /*select SPI Bus 0 or 1*/
    ,
    unsigned char SCS /*select SPI CS 0~3*/
    ,
    unsigned char flash /*select flash: 0 =MXIC , 1=WINBOND*/
)

{
    unsigned char temp;

    Enable_SFlash_SPI();
    SPI_Master_LatchEdge_Select_Falling();
    SPIM_Clock_Divided_1();
    SPI_Clock_Period(2);

    switch (BUS) {
        case 0:
            SPIM_Select_Bus_0();
            break;
        case 1:
            SPIM_Select_Bus_1();
            break;
    }

    switch (SCS) {
        case 0:
            Select_nSS_drive_on_xnsfcs0();
            break;

        case 1:
            Select_nSS_drive_on_xnsfcs1();
            break;

        case 2:
            Select_nSS_drive_on_xnsfcs2();
            break;

        case 3:
            Select_nSS_drive_on_xnsfcs3();
            break;
    }

    Reset_CPOL();
    // Set_CPOL();
    Reset_CPHA();
    // Set_CPHA();

    // WREN : write enable
    nSS_Active();
    SPI_Master_FIFO_Data_Put(0x06);
    nSS_Inactive();

    // RDSR : check writable

    do {
        nSS_Active();
        SPI_Master_FIFO_Data_Put(0x05); //
        temp = SPI_Master_FIFO_Data_Put(0xff);
        nSS_Inactive();
        delay_ms(1);
    } while ((temp & 0x02) == 0x00); // WEL=1 ? WRITABLE : UNWRITABLE

    switch (flash) {
        case 0:
            //**********************************MXIC Flash Quad mode
            // WRITE STATUS REG
            nSS_Active();
            SPI_Master_FIFO_Data_Put(0x01);
            SPI_Master_FIFO_Data_Put(0x40);
            nSS_Inactive();
            ///*************************************
            break;

        case 1:
            //******************************Winbond Flash Quad mode
            // WRITE STATUS REG
            nSS_Active();
            SPI_Master_FIFO_Data_Put(0x31); // Status Register-2
            SPI_Master_FIFO_Data_Put(0x02); // QE=1, Quad Mode
            nSS_Inactive();
            ///*****************************
            break;
        case 2:
            //******************************GD Flash Quad mode---DEBUGING.
            // WRITE STATUS REG
            nSS_Active();
            SPI_Master_FIFO_Data_Put(0x01);
            SPI_Master_FIFO_Data_Put(0x31); // Status Register-2
            SPI_Master_FIFO_Data_Put(0x38);
            nSS_Inactive();
            ///*****************************
            break;

    }

    // check flash busy
    do {
        // RDSR
        nSS_Active();
        SPI_Master_FIFO_Data_Put(0x05); //
        temp = SPI_Master_FIFO_Data_Put(0xff);
        nSS_Inactive();
    } while ((temp & 0x01) == 0x01); // WIP=1 ? BUSY:IDLE
}

