gwiethaus/RA8889/AI/STC8H_RA8889_8080/RA8889_01_Kernel/RA8889_API_51.c
void SPI_NOR_initial_DMA(
    unsigned char mode // SPI mode : 0:Single_03h,1:Single_0Bh,2:Single_1Bh,3:Dual_3Bh,4:Dual_BBh,5:Quad_6Bh,6:Quad_EBh
    ,
    unsigned char BUS // BUS : 0 = Use BUS0, 1 = Use BUS1
    ,
    unsigned char SCS // SCS : 0 = Use SCS0, 1 = Use SCS1 ,2 = Use SCS2 ,3 = Use SCS3
    ,
    unsigned char flash // 0 : MXIC , 1 : Winbond
    ,
    unsigned char addr_24b_32b // flash 24bit or 32bit addr
)
{
    unsigned char temp;

    Enable_SFlash_SPI();
    SPI_Master_LatchEdge_Select_Falling();
    SPIM_Clock_Divided_1();
    SPI_Clock_Period(2);

    switch (BUS) {
        case 0:
            FONT_DMA_Select_Bus_0();
            SPIM_Select_Bus_0();
            break;

        case 1:
            FONT_DMA_Select_Bus_1();
            SPIM_Select_Bus_1();
            break;
    }

    switch (SCS) {
        case 0:
            Select_SFI_0();
            Select_nSS_drive_on_xnsfcs0();
            break;

        case 1:
            Select_SFI_1();
            Select_nSS_drive_on_xnsfcs1();
            break;

        case 2:
            Select_SFI_2();
            Select_nSS_drive_on_xnsfcs2();
            break;

        case 3:
            Select_SFI_3();
            Select_nSS_drive_on_xnsfcs3();
            break;
    }

    Select_RA8875_SPI_Mode0_and_Mode3();

    switch (mode) {
        case 0:
            Select_SFI_Single_Mode_Dummy_0T_03h(); // single mode
            break;

        case 1:
            Select_SFI_Single_Mode_Dummy_8T_0Bh(); // single mode
            break;

        case 2:
            Select_SFI_Single_Mode_Dummy_16T_1Bh(); // single mode
            break;

        case 3:
            Select_SFI_Dual_Mode_Dummy_8T_3Bh(); // dual mode
            break;

        case 4:
            SPI_NOR_Flash_switch_QUAD_MODE(BUS, SCS, flash); // quad mode
            Select_SFI_Quad_Mode_Dummy_8T_6Bh();
            break;

        case 5:
            SPI_NOR_Flash_switch_QUAD_MODE(BUS, SCS, flash); // quad mode
            Select_SFI_Quad_Mode_Dummy_4T_EBh();
    }

    Select_SFI_DMA_Mode();

    if (addr_24b_32b == 0)
        Select_SFI_24bit_Address();
    else {
        switch_24bits_to_32bits(BUS, SCS);
        Select_SFI_32bit_Address();
    }
    Memory_XY_Mode();
    delay_ms(30);
}

void SPI_NOR_initial_JPG_AVI(
    unsigned char flash // 0 : MXIC , 1 : Winbond
    ,
    unsigned char addr_24b_32b // flash addr : 0:24bit addr, 1:32bit addr
    ,
    unsigned char BUS // BUS : 0 = Use BUS0, 1 = Use BUS1
    ,
    unsigned char SCS // SCS : 0 = Use SCS0, 1 = Use SCS1 ,2 = Use SCS2 ,3 = Use SCS3
    ,
    unsigned char SCK_Divide // media decode divide : IDEC Clock = CORE CLK/2^SCK_Divide ,range:0~3, recommend <= 60MHz
)
{
    unsigned char temp;

    Enable_SFlash_SPI();
    SPI_Master_LatchEdge_Select_Falling();
    SPIM_Clock_Divided_1();
    IDEC_SPI_Clock_Divide(SCK_Divide);
    SPI_Clock_Period(2);

    switch (BUS) {
        case 0:
            IDEC_Select_Bus_0(); // MEDIA ?I?IBUS 0
            SPIM_Select_Bus_0();
            break;
        case 1:
            IDEC_Select_Bus_1(); // MEDIA ?I?IBUS 1
            SPIM_Select_Bus_1();
            break;
    }

    switch (SCS) {
        case 0:
            IDEC_Select_SFI_0(); // MEDIA?I?ICS0
            Select_nSS_drive_on_xnsfcs0();
            break;

        case 1:
            IDEC_Select_SFI_1(); // MEDIA?I?ICS1
            Select_nSS_drive_on_xnsfcs1();
            break;

        case 2:
            IDEC_Select_SFI_2(); // MEDIA?I?ICS2
            Select_nSS_drive_on_xnsfcs2();
            break;

        case 3:
            IDEC_Select_SFI_3(); // MEDIA?I?ICS3
            Select_nSS_drive_on_xnsfcs3();
            break;
    }

    SPI_NOR_Flash_switch_QUAD_MODE(BUS, SCS, flash); // Into Quad Mode

    if (addr_24b_32b == 0)
        IDEC_Select_SFI_24bit_Address();
    else {
        switch_24bits_to_32bits(BUS, SCS);
        IDEC_Select_SFI_32bit_Address();
    }

    IDEC_Select_RA8875_SPI_Mode0_and_Mode3();
    IDEC_Select_SFI_Quad_Mode_Dummy_8T_6Bh(); // MEDIA QUAD MODE
    // IDEC_Select_SFI_Quad_Mode_Dummy_4T_EBh();

    IDEC_AVI_Decoding_to_PIP1_and_Shadow();
}

void JPG_NOR(
    unsigned long addr // JPG pic addr in flash
    ,
    unsigned long JPGsize // JPG pic size
    ,
    unsigned long IDEC_canvas_width // recommend = canvas_image_width
    ,
    unsigned short x // JPG pic write to sdram coordinate of x
    ,
    unsigned short y // JPG pic write to sdram coordinate of y
)
{

    IDEC_Destination_Image_Width(IDEC_canvas_width);
    IDEC_Destination_Upper_Left_Corner(x, y);

    IDEC_Source_Start_Address(addr); // JPG癬cl|i
    IDEC_Transfer_Number(JPGsize);   // JPG SIZE
    IDEC_Starts_Decoding();          //?}cl?NJPG
    Check_Busy_Media_Decode();
}

void AVI_NOR(
    unsigned long addr // AVI addr in flash
    ,
    unsigned long videosize // video size
    ,
    unsigned long shadow_buffer_addr // shadow buffer addr
    ,
    unsigned long PIP_buffer_addr // PIP buffer addr
    ,
    unsigned long x // show AVI to coordinate of x
    ,
    unsigned long y // show AVI to coordinate of y
    ,
    unsigned long height // vedio height
    ,
    unsigned long width // vedio width
    ,
    unsigned long PIP_width // PIP Image width, recommend = canvas_image_width
)
{

    IDEC_Source_Start_Address(addr);
    IDEC_Transfer_Number(videosize); // AVI File Size

    AVI_Shadow_PIP_Start_Address(shadow_buffer_addr);

    Select_PIP1_Parameter();

    PIP_Image_Start_Address(PIP_buffer_addr);
    PIP_Display_Start_XY(x, y);
    PIP_Image_Width(PIP_width);
    PIP_Window_Image_Start_XY(0, 0);
    PIP_Window_Width_Height(width, height);
    //	Enable_PIP1();
    // Check_Vsync_finished();
    IDEC_Starts_Decoding();
    // Check_Busy_Media_Decode();
}

void Print_Hex(unsigned char buf)
{
    unsigned char temp;
    temp = buf;
    temp = (temp >> 4) & 0x0F;
    Text_Mode();
    LCD_CmdWrite(0x04);

    if (temp < 0x0A) {
        temp |= 0x30;
    } else
        temp = temp + 0x37;
    LCD_DataWrite(temp);
    Check_Mem_WR_FIFO_not_Full();
    //	delay_ms(1);

    temp = buf;
    temp = temp & 0x0F;
    if (temp < 0x0A) {
        temp |= 0x30;
    } else
        temp = temp + 0x37;
    LCD_DataWrite(temp);
    //	delay_ms(1);
    Check_Mem_WR_FIFO_not_Full();
}